grevaillot/svd_tools/headers/ATSAMV71Q21B/mcan0.h
#pragma once 

/* --- MCAN0: Controller Area Network ------------------------------- */

/** @defgroup mcan0_registers Controller Area Network Register
@{*/

/** MCAN0_MCAN_CREL Core Release Register **/
#define MCAN0_MCAN_CREL			MMIO32(MCAN0_BASE + 0x00)
/** MCAN0_MCAN_ENDN Endian Register **/
#define MCAN0_MCAN_ENDN			MMIO32(MCAN0_BASE + 0x04)
/** MCAN0_MCAN_CUST Customer Register **/
#define MCAN0_MCAN_CUST			MMIO32(MCAN0_BASE + 0x08)
/** MCAN0_MCAN_DBTP Data Bit Timing and Prescaler Register **/
#define MCAN0_MCAN_DBTP			MMIO32(MCAN0_BASE + 0x0c)
/** MCAN0_MCAN_TEST Test Register **/
#define MCAN0_MCAN_TEST			MMIO32(MCAN0_BASE + 0x10)
/** MCAN0_MCAN_RWD RAM Watchdog Register **/
#define MCAN0_MCAN_RWD			MMIO32(MCAN0_BASE + 0x14)
/** MCAN0_MCAN_CCCR CC Control Register **/
#define MCAN0_MCAN_CCCR			MMIO32(MCAN0_BASE + 0x18)
/** MCAN0_MCAN_NBTP Nominal Bit Timing and Prescaler Register **/
#define MCAN0_MCAN_NBTP			MMIO32(MCAN0_BASE + 0x1c)
/** MCAN0_MCAN_TSCC Timestamp Counter Configuration Register **/
#define MCAN0_MCAN_TSCC			MMIO32(MCAN0_BASE + 0x20)
/** MCAN0_MCAN_TSCV Timestamp Counter Value Register **/
#define MCAN0_MCAN_TSCV			MMIO32(MCAN0_BASE + 0x24)
/** MCAN0_MCAN_TOCC Timeout Counter Configuration Register **/
#define MCAN0_MCAN_TOCC			MMIO32(MCAN0_BASE + 0x28)
/** MCAN0_MCAN_TOCV Timeout Counter Value Register **/
#define MCAN0_MCAN_TOCV			MMIO32(MCAN0_BASE + 0x2c)
/** MCAN0_MCAN_ECR Error Counter Register **/
#define MCAN0_MCAN_ECR			MMIO32(MCAN0_BASE + 0x40)
/** MCAN0_MCAN_PSR Protocol Status Register **/
#define MCAN0_MCAN_PSR			MMIO32(MCAN0_BASE + 0x44)
/** MCAN0_MCAN_TDCR Transmit Delay Compensation Register **/
#define MCAN0_MCAN_TDCR			MMIO32(MCAN0_BASE + 0x48)
/** MCAN0_MCAN_IR Interrupt Register **/
#define MCAN0_MCAN_IR			MMIO32(MCAN0_BASE + 0x50)
/** MCAN0_MCAN_IE Interrupt Enable Register **/
#define MCAN0_MCAN_IE			MMIO32(MCAN0_BASE + 0x54)
/** MCAN0_MCAN_ILS Interrupt Line Select Register **/
#define MCAN0_MCAN_ILS			MMIO32(MCAN0_BASE + 0x58)
/** MCAN0_MCAN_ILE Interrupt Line Enable Register **/
#define MCAN0_MCAN_ILE			MMIO32(MCAN0_BASE + 0x5c)
/** MCAN0_MCAN_GFC Global Filter Configuration Register **/
#define MCAN0_MCAN_GFC			MMIO32(MCAN0_BASE + 0x80)
/** MCAN0_MCAN_SIDFC Standard ID Filter Configuration Register **/
#define MCAN0_MCAN_SIDFC			MMIO32(MCAN0_BASE + 0x84)
/** MCAN0_MCAN_XIDFC Extended ID Filter Configuration Register **/
#define MCAN0_MCAN_XIDFC			MMIO32(MCAN0_BASE + 0x88)
/** MCAN0_MCAN_XIDAM Extended ID AND Mask Register **/
#define MCAN0_MCAN_XIDAM			MMIO32(MCAN0_BASE + 0x90)
/** MCAN0_MCAN_HPMS High Priority Message Status Register **/
#define MCAN0_MCAN_HPMS			MMIO32(MCAN0_BASE + 0x94)
/** MCAN0_MCAN_NDAT1 New Data 1 Register **/
#define MCAN0_MCAN_NDAT1			MMIO32(MCAN0_BASE + 0x98)
/** MCAN0_MCAN_NDAT2 New Data 2 Register **/
#define MCAN0_MCAN_NDAT2			MMIO32(MCAN0_BASE + 0x9c)
/** MCAN0_MCAN_RXF0C Receive FIFO 0 Configuration Register **/
#define MCAN0_MCAN_RXF0C			MMIO32(MCAN0_BASE + 0xa0)
/** MCAN0_MCAN_RXF0S Receive FIFO 0 Status Register **/
#define MCAN0_MCAN_RXF0S			MMIO32(MCAN0_BASE + 0xa4)
/** MCAN0_MCAN_RXF0A Receive FIFO 0 Acknowledge Register **/
#define MCAN0_MCAN_RXF0A			MMIO32(MCAN0_BASE + 0xa8)
/** MCAN0_MCAN_RXBC Receive Rx Buffer Configuration Register **/
#define MCAN0_MCAN_RXBC			MMIO32(MCAN0_BASE + 0xac)
/** MCAN0_MCAN_RXF1C Receive FIFO 1 Configuration Register **/
#define MCAN0_MCAN_RXF1C			MMIO32(MCAN0_BASE + 0xb0)
/** MCAN0_MCAN_RXF1S Receive FIFO 1 Status Register **/
#define MCAN0_MCAN_RXF1S			MMIO32(MCAN0_BASE + 0xb4)
/** MCAN0_MCAN_RXF1A Receive FIFO 1 Acknowledge Register **/
#define MCAN0_MCAN_RXF1A			MMIO32(MCAN0_BASE + 0xb8)
/** MCAN0_MCAN_RXESC Receive Buffer / FIFO Element Size Configuration Register **/
#define MCAN0_MCAN_RXESC			MMIO32(MCAN0_BASE + 0xbc)
/** MCAN0_MCAN_TXBC Transmit Buffer Configuration Register **/
#define MCAN0_MCAN_TXBC			MMIO32(MCAN0_BASE + 0xc0)
/** MCAN0_MCAN_TXFQS Transmit FIFO/Queue Status Register **/
#define MCAN0_MCAN_TXFQS			MMIO32(MCAN0_BASE + 0xc4)
/** MCAN0_MCAN_TXESC Transmit Buffer Element Size Configuration Register **/
#define MCAN0_MCAN_TXESC			MMIO32(MCAN0_BASE + 0xc8)
/** MCAN0_MCAN_TXBRP Transmit Buffer Request Pending Register **/
#define MCAN0_MCAN_TXBRP			MMIO32(MCAN0_BASE + 0xcc)
/** MCAN0_MCAN_TXBAR Transmit Buffer Add Request Register **/
#define MCAN0_MCAN_TXBAR			MMIO32(MCAN0_BASE + 0xd0)
/** MCAN0_MCAN_TXBCR Transmit Buffer Cancellation Request Register **/
#define MCAN0_MCAN_TXBCR			MMIO32(MCAN0_BASE + 0xd4)
/** MCAN0_MCAN_TXBTO Transmit Buffer Transmission Occurred Register **/
#define MCAN0_MCAN_TXBTO			MMIO32(MCAN0_BASE + 0xd8)
/** MCAN0_MCAN_TXBCF Transmit Buffer Cancellation Finished Register **/
#define MCAN0_MCAN_TXBCF			MMIO32(MCAN0_BASE + 0xdc)
/** MCAN0_MCAN_TXBTIE Transmit Buffer Transmission Interrupt Enable Register **/
#define MCAN0_MCAN_TXBTIE			MMIO32(MCAN0_BASE + 0xe0)
/** MCAN0_MCAN_TXBCIE Transmit Buffer Cancellation Finished Interrupt Enable Register **/
#define MCAN0_MCAN_TXBCIE			MMIO32(MCAN0_BASE + 0xe4)
/** MCAN0_MCAN_TXEFC Transmit Event FIFO Configuration Register **/
#define MCAN0_MCAN_TXEFC			MMIO32(MCAN0_BASE + 0xf0)
/** MCAN0_MCAN_TXEFS Transmit Event FIFO Status Register **/
#define MCAN0_MCAN_TXEFS			MMIO32(MCAN0_BASE + 0xf4)
/** MCAN0_MCAN_TXEFA Transmit Event FIFO Acknowledge Register **/
#define MCAN0_MCAN_TXEFA			MMIO32(MCAN0_BASE + 0xf8)

/**@}*/


/** @defgroup mcan0_mcan_crel MCANCREL Core Release Register
@{*/


#define MCAN0_MCAN_CREL_REL_SHIFT		28
#define MCAN0_MCAN_CREL_REL_MASK		0x0f
/** @defgroup mcan0_mcan_crel_rel REL Core Release
@{*/
/**@}*/


#define MCAN0_MCAN_CREL_STEP_SHIFT		24
#define MCAN0_MCAN_CREL_STEP_MASK		0x0f
/** @defgroup mcan0_mcan_crel_step STEP Step of Core Release
@{*/
/**@}*/


#define MCAN0_MCAN_CREL_SUBSTEP_SHIFT		20
#define MCAN0_MCAN_CREL_SUBSTEP_MASK		0x0f
/** @defgroup mcan0_mcan_crel_substep SUBSTEP Sub-step of Core Release
@{*/
/**@}*/


#define MCAN0_MCAN_CREL_YEAR_SHIFT		16
#define MCAN0_MCAN_CREL_YEAR_MASK		0x0f
/** @defgroup mcan0_mcan_crel_year YEAR Timestamp Year
@{*/
/**@}*/


#define MCAN0_MCAN_CREL_MON_SHIFT		8
#define MCAN0_MCAN_CREL_MON_MASK		0xff
/** @defgroup mcan0_mcan_crel_mon MON Timestamp Month
@{*/
/**@}*/


#define MCAN0_MCAN_CREL_DAY_SHIFT		0
#define MCAN0_MCAN_CREL_DAY_MASK		0xff
/** @defgroup mcan0_mcan_crel_day DAY Timestamp Day
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_endn MCANENDN Endian Register
@{*/


#define MCAN0_MCAN_ENDN_ETV_SHIFT		0
#define MCAN0_MCAN_ENDN_ETV_MASK		0xffffffff
/** @defgroup mcan0_mcan_endn_etv ETV Endianness Test Value
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_cust MCANCUST Customer Register
@{*/


#define MCAN0_MCAN_CUST_CSV_SHIFT		0
#define MCAN0_MCAN_CUST_CSV_MASK		0xffffffff
/** @defgroup mcan0_mcan_cust_csv CSV Customer-specific Value
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_dbtp MCANDBTP Data Bit Timing and Prescaler Register
@{*/

/** MCAN0_MCAN_DBTP_TDC Transmitter Delay Compensation **/
#define MCAN0_MCAN_DBTP_TDC		(1 << 23)

