grevaillot/svd_tools/headers/ATSAMV71Q21B/mcan0.h
#define MCAN0_MCAN_DBTP_DBRP_SHIFT		16
#define MCAN0_MCAN_DBTP_DBRP_MASK		0x1f
/** @defgroup mcan0_mcan_dbtp_dbrp DBRP Data Bit Rate Prescaler
@{*/
/**@}*/


#define MCAN0_MCAN_DBTP_DTSEG1_SHIFT		8
#define MCAN0_MCAN_DBTP_DTSEG1_MASK		0x1f
/** @defgroup mcan0_mcan_dbtp_dtseg1 DTSEG1 Data Time Segment Before Sample Point
@{*/
/**@}*/


#define MCAN0_MCAN_DBTP_DTSEG2_SHIFT		4
#define MCAN0_MCAN_DBTP_DTSEG2_MASK		0x0f
/** @defgroup mcan0_mcan_dbtp_dtseg2 DTSEG2 Data Time Segment After Sample Point
@{*/
/**@}*/


#define MCAN0_MCAN_DBTP_DSJW_SHIFT		0
#define MCAN0_MCAN_DBTP_DSJW_MASK		0x07
/** @defgroup mcan0_mcan_dbtp_dsjw DSJW Data (Re) Synchronization Jump Width
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_test MCANTEST Test Register
@{*/

/** MCAN0_MCAN_TEST_RX Receive Pin (read-only) **/
#define MCAN0_MCAN_TEST_RX		(1 << 7)

#define MCAN0_MCAN_TEST_TX_SHIFT		5
#define MCAN0_MCAN_TEST_TX_MASK		0x03
/** @defgroup mcan0_mcan_test_tx TX Control of Transmit Pin (read/write)
@{*/
/**@}*/

/** MCAN0_MCAN_TEST_LBCK Loop Back Mode (read/write) **/
#define MCAN0_MCAN_TEST_LBCK		(1 << 4)

/**@}*/

/** @defgroup mcan0_mcan_rwd MCANRWD RAM Watchdog Register
@{*/


#define MCAN0_MCAN_RWD_WDV_SHIFT		8
#define MCAN0_MCAN_RWD_WDV_MASK		0xff
/** @defgroup mcan0_mcan_rwd_wdv WDV Watchdog Value (read-only)
@{*/
/**@}*/


#define MCAN0_MCAN_RWD_WDC_SHIFT		0
#define MCAN0_MCAN_RWD_WDC_MASK		0xff
/** @defgroup mcan0_mcan_rwd_wdc WDC Watchdog Configuration (read/write)
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_cccr MCANCCCR CC Control Register
@{*/

/** MCAN0_MCAN_CCCR_NISO Non-ISO Operation **/
#define MCAN0_MCAN_CCCR_NISO		(1 << 15)
/** MCAN0_MCAN_CCCR_TXP Transmit Pause (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_TXP		(1 << 14)
/** MCAN0_MCAN_CCCR_EFBI Edge Filtering during Bus Integration (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_EFBI		(1 << 13)
/** MCAN0_MCAN_CCCR_PXHD Protocol Exception Event Handling (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_PXHD		(1 << 12)
/** MCAN0_MCAN_CCCR_BRSE Bit Rate Switching Enable (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_BRSE		(1 << 9)
/** MCAN0_MCAN_CCCR_FDOE CAN FD Operation Enable (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_FDOE		(1 << 8)
/** MCAN0_MCAN_CCCR_TEST Test Mode Enable (read/write, write protection against '1') **/
#define MCAN0_MCAN_CCCR_TEST		(1 << 7)
/** MCAN0_MCAN_CCCR_DAR Disable Automatic Retransmission (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_DAR		(1 << 6)
/** MCAN0_MCAN_CCCR_MON Bus Monitoring Mode (read/write, write protection against '1') **/
#define MCAN0_MCAN_CCCR_MON		(1 << 5)
/** MCAN0_MCAN_CCCR_CSR Clock Stop Request (read/write) **/
#define MCAN0_MCAN_CCCR_CSR		(1 << 4)
/** MCAN0_MCAN_CCCR_CSA Clock Stop Acknowledge (read-only) **/
#define MCAN0_MCAN_CCCR_CSA		(1 << 3)
/** MCAN0_MCAN_CCCR_ASM Restricted Operation Mode (read/write, write protection against '1') **/
#define MCAN0_MCAN_CCCR_ASM		(1 << 2)
/** MCAN0_MCAN_CCCR_CCE Configuration Change Enable (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_CCE		(1 << 1)
/** MCAN0_MCAN_CCCR_INIT Initialization (read/write) **/
#define MCAN0_MCAN_CCCR_INIT		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_nbtp MCANNBTP Nominal Bit Timing and Prescaler Register
@{*/


#define MCAN0_MCAN_NBTP_NSJW_SHIFT		25
#define MCAN0_MCAN_NBTP_NSJW_MASK		0x7f
/** @defgroup mcan0_mcan_nbtp_nsjw NSJW Nominal (Re) Synchronization Jump Width
@{*/
/**@}*/


#define MCAN0_MCAN_NBTP_NBRP_SHIFT		16
#define MCAN0_MCAN_NBTP_NBRP_MASK		0x1ff
/** @defgroup mcan0_mcan_nbtp_nbrp NBRP Nominal Bit Rate Prescaler
@{*/
/**@}*/


#define MCAN0_MCAN_NBTP_NTSEG1_SHIFT		8
#define MCAN0_MCAN_NBTP_NTSEG1_MASK		0xff
/** @defgroup mcan0_mcan_nbtp_ntseg1 NTSEG1 Nominal Time Segment Before Sample Point
@{*/
/**@}*/


#define MCAN0_MCAN_NBTP_NTSEG2_SHIFT		0
#define MCAN0_MCAN_NBTP_NTSEG2_MASK		0x7f
/** @defgroup mcan0_mcan_nbtp_ntseg2 NTSEG2 Nominal Time Segment After Sample Point
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_tscc MCANTSCC Timestamp Counter Configuration Register
@{*/


#define MCAN0_MCAN_TSCC_TCP_SHIFT		16
#define MCAN0_MCAN_TSCC_TCP_MASK		0x0f
/** @defgroup mcan0_mcan_tscc_tcp TCP Timestamp Counter Prescaler
@{*/
/**@}*/


#define MCAN0_MCAN_TSCC_TSS_SHIFT		0
#define MCAN0_MCAN_TSCC_TSS_MASK		0x03
/** @defgroup mcan0_mcan_tscc_tss TSS Timestamp Select
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_tscv MCANTSCV Timestamp Counter Value Register
@{*/


#define MCAN0_MCAN_TSCV_TSC_SHIFT		0
#define MCAN0_MCAN_TSCV_TSC_MASK		0xffff
/** @defgroup mcan0_mcan_tscv_tsc TSC Timestamp Counter (cleared on write)
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_tocc MCANTOCC Timeout Counter Configuration Register
@{*/


#define MCAN0_MCAN_TOCC_TOP_SHIFT		16
#define MCAN0_MCAN_TOCC_TOP_MASK		0xffff
/** @defgroup mcan0_mcan_tocc_top TOP Timeout Period
@{*/
/**@}*/


#define MCAN0_MCAN_TOCC_TOS_SHIFT		1
#define MCAN0_MCAN_TOCC_TOS_MASK		0x03
/** @defgroup mcan0_mcan_tocc_tos TOS Timeout Select
@{*/
/**@}*/

/** MCAN0_MCAN_TOCC_ETOC Enable Timeout Counter **/
#define MCAN0_MCAN_TOCC_ETOC		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_tocv MCANTOCV Timeout Counter Value Register
@{*/


#define MCAN0_MCAN_TOCV_TOC_SHIFT		0
#define MCAN0_MCAN_TOCV_TOC_MASK		0xffff
/** @defgroup mcan0_mcan_tocv_toc TOC Timeout Counter (cleared on write)
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_ecr MCANECR Error Counter Register
@{*/


#define MCAN0_MCAN_ECR_CEL_SHIFT		16
#define MCAN0_MCAN_ECR_CEL_MASK		0xff
/** @defgroup mcan0_mcan_ecr_cel CEL CAN Error Logging (cleared on read)
@{*/
/**@}*/

/** MCAN0_MCAN_ECR_RP Receive Error Passive **/
#define MCAN0_MCAN_ECR_RP		(1 << 15)

#define MCAN0_MCAN_ECR_REC_SHIFT		8
#define MCAN0_MCAN_ECR_REC_MASK		0x7f
/** @defgroup mcan0_mcan_ecr_rec REC Receive Error Counter
@{*/
/**@}*/


#define MCAN0_MCAN_ECR_TEC_SHIFT		0
#define MCAN0_MCAN_ECR_TEC_MASK		0xff
/** @defgroup mcan0_mcan_ecr_tec TEC Transmit Error Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_psr MCANPSR Protocol Status Register
@{*/


