grevaillot/svd_tools/headers/ATSAMV71Q21B/mcan0.h
/** MCAN0_MCAN_RXF0C_F0OM FIFO 0 Operation Mode **/
#define MCAN0_MCAN_RXF0C_F0OM		(1 << 31)

#define MCAN0_MCAN_RXF0C_F0WM_SHIFT		24
#define MCAN0_MCAN_RXF0C_F0WM_MASK		0x7f
/** @defgroup mcan0_mcan_rxf0c_f0wm F0WM Receive FIFO 0 Watermark
@{*/
/**@}*/


#define MCAN0_MCAN_RXF0C_F0S_SHIFT		16
#define MCAN0_MCAN_RXF0C_F0S_MASK		0x7f
/** @defgroup mcan0_mcan_rxf0c_f0s F0S Receive FIFO 0 Start Address
@{*/
/**@}*/


#define MCAN0_MCAN_RXF0C_F0SA_SHIFT		2
#define MCAN0_MCAN_RXF0C_F0SA_MASK		0x3fff
/** @defgroup mcan0_mcan_rxf0c_f0sa F0SA Receive FIFO 0 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_rxf0s MCANRXF0S Receive FIFO 0 Status Register
@{*/

/** MCAN0_MCAN_RXF0S_RF0L Receive FIFO 0 Message Lost **/
#define MCAN0_MCAN_RXF0S_RF0L		(1 << 25)
/** MCAN0_MCAN_RXF0S_F0F Receive FIFO 0 Fill Level **/
#define MCAN0_MCAN_RXF0S_F0F		(1 << 24)

#define MCAN0_MCAN_RXF0S_F0PI_SHIFT		16
#define MCAN0_MCAN_RXF0S_F0PI_MASK		0x3f
/** @defgroup mcan0_mcan_rxf0s_f0pi F0PI Receive FIFO 0 Put Index
@{*/
/**@}*/


#define MCAN0_MCAN_RXF0S_F0GI_SHIFT		8
#define MCAN0_MCAN_RXF0S_F0GI_MASK		0x3f
/** @defgroup mcan0_mcan_rxf0s_f0gi F0GI Receive FIFO 0 Get Index
@{*/
/**@}*/


#define MCAN0_MCAN_RXF0S_F0FL_SHIFT		0
#define MCAN0_MCAN_RXF0S_F0FL_MASK		0x7f
/** @defgroup mcan0_mcan_rxf0s_f0fl F0FL Receive FIFO 0 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_rxf0a MCANRXF0A Receive FIFO 0 Acknowledge Register
@{*/


#define MCAN0_MCAN_RXF0A_F0AI_SHIFT		0
#define MCAN0_MCAN_RXF0A_F0AI_MASK		0x3f
/** @defgroup mcan0_mcan_rxf0a_f0ai F0AI Receive FIFO 0 Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_rxbc MCANRXBC Receive Rx Buffer Configuration Register
@{*/


#define MCAN0_MCAN_RXBC_RBSA_SHIFT		2
#define MCAN0_MCAN_RXBC_RBSA_MASK		0x3fff
/** @defgroup mcan0_mcan_rxbc_rbsa RBSA Receive Buffer Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_rxf1c MCANRXF1C Receive FIFO 1 Configuration Register
@{*/

/** MCAN0_MCAN_RXF1C_F1OM FIFO 1 Operation Mode **/
#define MCAN0_MCAN_RXF1C_F1OM		(1 << 31)

#define MCAN0_MCAN_RXF1C_F1WM_SHIFT		24
#define MCAN0_MCAN_RXF1C_F1WM_MASK		0x7f
/** @defgroup mcan0_mcan_rxf1c_f1wm F1WM Receive FIFO 1 Watermark
@{*/
/**@}*/


#define MCAN0_MCAN_RXF1C_F1S_SHIFT		16
#define MCAN0_MCAN_RXF1C_F1S_MASK		0x7f
/** @defgroup mcan0_mcan_rxf1c_f1s F1S Receive FIFO 1 Start Address
@{*/
/**@}*/


#define MCAN0_MCAN_RXF1C_F1SA_SHIFT		2
#define MCAN0_MCAN_RXF1C_F1SA_MASK		0x3fff
/** @defgroup mcan0_mcan_rxf1c_f1sa F1SA Receive FIFO 1 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_rxf1s MCANRXF1S Receive FIFO 1 Status Register
@{*/


#define MCAN0_MCAN_RXF1S_DMS_SHIFT		30
#define MCAN0_MCAN_RXF1S_DMS_MASK		0x03
/** @defgroup mcan0_mcan_rxf1s_dms DMS Debug Message Status
@{*/
/**@}*/

/** MCAN0_MCAN_RXF1S_RF1L Receive FIFO 1 Message Lost **/
#define MCAN0_MCAN_RXF1S_RF1L		(1 << 25)
/** MCAN0_MCAN_RXF1S_F1F Receive FIFO 1 Fill Level **/
#define MCAN0_MCAN_RXF1S_F1F		(1 << 24)

#define MCAN0_MCAN_RXF1S_F1PI_SHIFT		16
#define MCAN0_MCAN_RXF1S_F1PI_MASK		0x3f
/** @defgroup mcan0_mcan_rxf1s_f1pi F1PI Receive FIFO 1 Put Index
@{*/
/**@}*/


#define MCAN0_MCAN_RXF1S_F1GI_SHIFT		8
#define MCAN0_MCAN_RXF1S_F1GI_MASK		0x3f
/** @defgroup mcan0_mcan_rxf1s_f1gi F1GI Receive FIFO 1 Get Index
@{*/
/**@}*/


#define MCAN0_MCAN_RXF1S_F1FL_SHIFT		0
#define MCAN0_MCAN_RXF1S_F1FL_MASK		0x7f
/** @defgroup mcan0_mcan_rxf1s_f1fl F1FL Receive FIFO 1 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_rxf1a MCANRXF1A Receive FIFO 1 Acknowledge Register
@{*/


#define MCAN0_MCAN_RXF1A_F1AI_SHIFT		0
#define MCAN0_MCAN_RXF1A_F1AI_MASK		0x3f
/** @defgroup mcan0_mcan_rxf1a_f1ai F1AI Receive FIFO 1 Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_rxesc MCANRXESC Receive Buffer / FIFO Element Size Configuration Register
@{*/


#define MCAN0_MCAN_RXESC_RBDS_SHIFT		8
#define MCAN0_MCAN_RXESC_RBDS_MASK		0x07
/** @defgroup mcan0_mcan_rxesc_rbds RBDS Receive Buffer Data Field Size
@{*/
/**@}*/


#define MCAN0_MCAN_RXESC_F1DS_SHIFT		4
#define MCAN0_MCAN_RXESC_F1DS_MASK		0x07
/** @defgroup mcan0_mcan_rxesc_f1ds F1DS Receive FIFO 1 Data Field Size
@{*/
/**@}*/


#define MCAN0_MCAN_RXESC_F0DS_SHIFT		0
#define MCAN0_MCAN_RXESC_F0DS_MASK		0x07
/** @defgroup mcan0_mcan_rxesc_f0ds F0DS Receive FIFO 0 Data Field Size
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_txbc MCANTXBC Transmit Buffer Configuration Register
@{*/

/** MCAN0_MCAN_TXBC_TFQM Tx FIFO/Queue Mode **/
#define MCAN0_MCAN_TXBC_TFQM		(1 << 30)

#define MCAN0_MCAN_TXBC_TFQS_SHIFT		24
#define MCAN0_MCAN_TXBC_TFQS_MASK		0x3f
/** @defgroup mcan0_mcan_txbc_tfqs TFQS Transmit FIFO/Queue Size
@{*/
/**@}*/


#define MCAN0_MCAN_TXBC_NDTB_SHIFT		16
#define MCAN0_MCAN_TXBC_NDTB_MASK		0x3f
/** @defgroup mcan0_mcan_txbc_ndtb NDTB Number of Dedicated Transmit Buffers
@{*/
/**@}*/


#define MCAN0_MCAN_TXBC_TBSA_SHIFT		2
#define MCAN0_MCAN_TXBC_TBSA_MASK		0x3fff
/** @defgroup mcan0_mcan_txbc_tbsa TBSA Tx Buffers Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_txfqs MCANTXFQS Transmit FIFO/Queue Status Register
@{*/

/** MCAN0_MCAN_TXFQS_TFQF Tx FIFO/Queue Full **/
#define MCAN0_MCAN_TXFQS_TFQF		(1 << 21)

#define MCAN0_MCAN_TXFQS_TFQPI_SHIFT		16
#define MCAN0_MCAN_TXFQS_TFQPI_MASK		0x1f
/** @defgroup mcan0_mcan_txfqs_tfqpi TFQPI Tx FIFO/Queue Put Index
@{*/
/**@}*/


#define MCAN0_MCAN_TXFQS_TFGI_SHIFT		8
#define MCAN0_MCAN_TXFQS_TFGI_MASK		0x1f
/** @defgroup mcan0_mcan_txfqs_tfgi TFGI Tx FIFO Get Index
@{*/
/**@}*/


#define MCAN0_MCAN_TXFQS_TFFL_SHIFT		0
#define MCAN0_MCAN_TXFQS_TFFL_MASK		0x3f
/** @defgroup mcan0_mcan_txfqs_tffl TFFL Tx FIFO Free Level
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_txesc MCANTXESC Transmit Buffer Element Size Configuration Register
@{*/


#define MCAN0_MCAN_TXESC_TBDS_SHIFT		0
#define MCAN0_MCAN_TXESC_TBDS_MASK		0x07
/** @defgroup mcan0_mcan_txesc_tbds TBDS Tx Buffer Data Field Size
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_txbrp MCANTXBRP Transmit Buffer Request Pending Register
@{*/

/** MCAN0_MCAN_TXBRP_TRP31 Transmission Request Pending for Buffer 31 **/
#define MCAN0_MCAN_TXBRP_TRP31		(1 << 31)
/** MCAN0_MCAN_TXBRP_TRP30 Transmission Request Pending for Buffer 30 **/
#define MCAN0_MCAN_TXBRP_TRP30		(1 << 30)
/** MCAN0_MCAN_TXBRP_TRP29 Transmission Request Pending for Buffer 29 **/
#define MCAN0_MCAN_TXBRP_TRP29		(1 << 29)
/** MCAN0_MCAN_TXBRP_TRP28 Transmission Request Pending for Buffer 28 **/
#define MCAN0_MCAN_TXBRP_TRP28		(1 << 28)
/** MCAN0_MCAN_TXBRP_TRP27 Transmission Request Pending for Buffer 27 **/
#define MCAN0_MCAN_TXBRP_TRP27		(1 << 27)
/** MCAN0_MCAN_TXBRP_TRP26 Transmission Request Pending for Buffer 26 **/
#define MCAN0_MCAN_TXBRP_TRP26		(1 << 26)
/** MCAN0_MCAN_TXBRP_TRP25 Transmission Request Pending for Buffer 25 **/
#define MCAN0_MCAN_TXBRP_TRP25		(1 << 25)
/** MCAN0_MCAN_TXBRP_TRP24 Transmission Request Pending for Buffer 24 **/
#define MCAN0_MCAN_TXBRP_TRP24		(1 << 24)
/** MCAN0_MCAN_TXBRP_TRP23 Transmission Request Pending for Buffer 23 **/
#define MCAN0_MCAN_TXBRP_TRP23		(1 << 23)
/** MCAN0_MCAN_TXBRP_TRP22 Transmission Request Pending for Buffer 22 **/
#define MCAN0_MCAN_TXBRP_TRP22		(1 << 22)
/** MCAN0_MCAN_TXBRP_TRP21 Transmission Request Pending for Buffer 21 **/
#define MCAN0_MCAN_TXBRP_TRP21		(1 << 21)
/** MCAN0_MCAN_TXBRP_TRP20 Transmission Request Pending for Buffer 20 **/
#define MCAN0_MCAN_TXBRP_TRP20		(1 << 20)
/** MCAN0_MCAN_TXBRP_TRP19 Transmission Request Pending for Buffer 19 **/
#define MCAN0_MCAN_TXBRP_TRP19		(1 << 19)
/** MCAN0_MCAN_TXBRP_TRP18 Transmission Request Pending for Buffer 18 **/
#define MCAN0_MCAN_TXBRP_TRP18		(1 << 18)
/** MCAN0_MCAN_TXBRP_TRP17 Transmission Request Pending for Buffer 17 **/
#define MCAN0_MCAN_TXBRP_TRP17		(1 << 17)
/** MCAN0_MCAN_TXBRP_TRP16 Transmission Request Pending for Buffer 16 **/
#define MCAN0_MCAN_TXBRP_TRP16		(1 << 16)
/** MCAN0_MCAN_TXBRP_TRP15 Transmission Request Pending for Buffer 15 **/
#define MCAN0_MCAN_TXBRP_TRP15		(1 << 15)
/** MCAN0_MCAN_TXBRP_TRP14 Transmission Request Pending for Buffer 14 **/
#define MCAN0_MCAN_TXBRP_TRP14		(1 << 14)
/** MCAN0_MCAN_TXBRP_TRP13 Transmission Request Pending for Buffer 13 **/
#define MCAN0_MCAN_TXBRP_TRP13		(1 << 13)
/** MCAN0_MCAN_TXBRP_TRP12 Transmission Request Pending for Buffer 12 **/
#define MCAN0_MCAN_TXBRP_TRP12		(1 << 12)
/** MCAN0_MCAN_TXBRP_TRP11 Transmission Request Pending for Buffer 11 **/
#define MCAN0_MCAN_TXBRP_TRP11		(1 << 11)
/** MCAN0_MCAN_TXBRP_TRP10 Transmission Request Pending for Buffer 10 **/
#define MCAN0_MCAN_TXBRP_TRP10		(1 << 10)
/** MCAN0_MCAN_TXBRP_TRP9 Transmission Request Pending for Buffer 9 **/
#define MCAN0_MCAN_TXBRP_TRP9		(1 << 9)
/** MCAN0_MCAN_TXBRP_TRP8 Transmission Request Pending for Buffer 8 **/
#define MCAN0_MCAN_TXBRP_TRP8		(1 << 8)
/** MCAN0_MCAN_TXBRP_TRP7 Transmission Request Pending for Buffer 7 **/
#define MCAN0_MCAN_TXBRP_TRP7		(1 << 7)
/** MCAN0_MCAN_TXBRP_TRP6 Transmission Request Pending for Buffer 6 **/
#define MCAN0_MCAN_TXBRP_TRP6		(1 << 6)
/** MCAN0_MCAN_TXBRP_TRP5 Transmission Request Pending for Buffer 5 **/
#define MCAN0_MCAN_TXBRP_TRP5		(1 << 5)
/** MCAN0_MCAN_TXBRP_TRP4 Transmission Request Pending for Buffer 4 **/
#define MCAN0_MCAN_TXBRP_TRP4		(1 << 4)
/** MCAN0_MCAN_TXBRP_TRP3 Transmission Request Pending for Buffer 3 **/
#define MCAN0_MCAN_TXBRP_TRP3		(1 << 3)
/** MCAN0_MCAN_TXBRP_TRP2 Transmission Request Pending for Buffer 2 **/
#define MCAN0_MCAN_TXBRP_TRP2		(1 << 2)
/** MCAN0_MCAN_TXBRP_TRP1 Transmission Request Pending for Buffer 1 **/
#define MCAN0_MCAN_TXBRP_TRP1		(1 << 1)
/** MCAN0_MCAN_TXBRP_TRP0 Transmission Request Pending for Buffer 0 **/
#define MCAN0_MCAN_TXBRP_TRP0		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_txbar MCANTXBAR Transmit Buffer Add Request Register
@{*/

/** MCAN0_MCAN_TXBAR_AR31 Add Request for Transmit Buffer 31 **/
#define MCAN0_MCAN_TXBAR_AR31		(1 << 31)
/** MCAN0_MCAN_TXBAR_AR30 Add Request for Transmit Buffer 30 **/
#define MCAN0_MCAN_TXBAR_AR30		(1 << 30)
/** MCAN0_MCAN_TXBAR_AR29 Add Request for Transmit Buffer 29 **/
#define MCAN0_MCAN_TXBAR_AR29		(1 << 29)
/** MCAN0_MCAN_TXBAR_AR28 Add Request for Transmit Buffer 28 **/
#define MCAN0_MCAN_TXBAR_AR28		(1 << 28)
/** MCAN0_MCAN_TXBAR_AR27 Add Request for Transmit Buffer 27 **/
#define MCAN0_MCAN_TXBAR_AR27		(1 << 27)
/** MCAN0_MCAN_TXBAR_AR26 Add Request for Transmit Buffer 26 **/
#define MCAN0_MCAN_TXBAR_AR26		(1 << 26)
/** MCAN0_MCAN_TXBAR_AR25 Add Request for Transmit Buffer 25 **/
#define MCAN0_MCAN_TXBAR_AR25		(1 << 25)
/** MCAN0_MCAN_TXBAR_AR24 Add Request for Transmit Buffer 24 **/
#define MCAN0_MCAN_TXBAR_AR24		(1 << 24)
/** MCAN0_MCAN_TXBAR_AR23 Add Request for Transmit Buffer 23 **/
#define MCAN0_MCAN_TXBAR_AR23		(1 << 23)
/** MCAN0_MCAN_TXBAR_AR22 Add Request for Transmit Buffer 22 **/
#define MCAN0_MCAN_TXBAR_AR22		(1 << 22)
/** MCAN0_MCAN_TXBAR_AR21 Add Request for Transmit Buffer 21 **/
#define MCAN0_MCAN_TXBAR_AR21		(1 << 21)
/** MCAN0_MCAN_TXBAR_AR20 Add Request for Transmit Buffer 20 **/
#define MCAN0_MCAN_TXBAR_AR20		(1 << 20)
/** MCAN0_MCAN_TXBAR_AR19 Add Request for Transmit Buffer 19 **/
#define MCAN0_MCAN_TXBAR_AR19		(1 << 19)
/** MCAN0_MCAN_TXBAR_AR18 Add Request for Transmit Buffer 18 **/
#define MCAN0_MCAN_TXBAR_AR18		(1 << 18)
/** MCAN0_MCAN_TXBAR_AR17 Add Request for Transmit Buffer 17 **/
#define MCAN0_MCAN_TXBAR_AR17		(1 << 17)
/** MCAN0_MCAN_TXBAR_AR16 Add Request for Transmit Buffer 16 **/
#define MCAN0_MCAN_TXBAR_AR16		(1 << 16)
/** MCAN0_MCAN_TXBAR_AR15 Add Request for Transmit Buffer 15 **/
#define MCAN0_MCAN_TXBAR_AR15		(1 << 15)
/** MCAN0_MCAN_TXBAR_AR14 Add Request for Transmit Buffer 14 **/
#define MCAN0_MCAN_TXBAR_AR14		(1 << 14)
/** MCAN0_MCAN_TXBAR_AR13 Add Request for Transmit Buffer 13 **/
#define MCAN0_MCAN_TXBAR_AR13		(1 << 13)
/** MCAN0_MCAN_TXBAR_AR12 Add Request for Transmit Buffer 12 **/
#define MCAN0_MCAN_TXBAR_AR12		(1 << 12)
/** MCAN0_MCAN_TXBAR_AR11 Add Request for Transmit Buffer 11 **/
#define MCAN0_MCAN_TXBAR_AR11		(1 << 11)
/** MCAN0_MCAN_TXBAR_AR10 Add Request for Transmit Buffer 10 **/
#define MCAN0_MCAN_TXBAR_AR10		(1 << 10)
/** MCAN0_MCAN_TXBAR_AR9 Add Request for Transmit Buffer 9 **/
#define MCAN0_MCAN_TXBAR_AR9		(1 << 9)
/** MCAN0_MCAN_TXBAR_AR8 Add Request for Transmit Buffer 8 **/
#define MCAN0_MCAN_TXBAR_AR8		(1 << 8)
/** MCAN0_MCAN_TXBAR_AR7 Add Request for Transmit Buffer 7 **/
#define MCAN0_MCAN_TXBAR_AR7		(1 << 7)
/** MCAN0_MCAN_TXBAR_AR6 Add Request for Transmit Buffer 6 **/
#define MCAN0_MCAN_TXBAR_AR6		(1 << 6)
/** MCAN0_MCAN_TXBAR_AR5 Add Request for Transmit Buffer 5 **/
#define MCAN0_MCAN_TXBAR_AR5		(1 << 5)
/** MCAN0_MCAN_TXBAR_AR4 Add Request for Transmit Buffer 4 **/
#define MCAN0_MCAN_TXBAR_AR4		(1 << 4)
/** MCAN0_MCAN_TXBAR_AR3 Add Request for Transmit Buffer 3 **/
#define MCAN0_MCAN_TXBAR_AR3		(1 << 3)
/** MCAN0_MCAN_TXBAR_AR2 Add Request for Transmit Buffer 2 **/
#define MCAN0_MCAN_TXBAR_AR2		(1 << 2)
/** MCAN0_MCAN_TXBAR_AR1 Add Request for Transmit Buffer 1 **/
#define MCAN0_MCAN_TXBAR_AR1		(1 << 1)
/** MCAN0_MCAN_TXBAR_AR0 Add Request for Transmit Buffer 0 **/
#define MCAN0_MCAN_TXBAR_AR0		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_txbcr MCANTXBCR Transmit Buffer Cancellation Request Register
@{*/

/** MCAN0_MCAN_TXBCR_CR31 Cancellation Request for Transmit Buffer 31 **/
#define MCAN0_MCAN_TXBCR_CR31		(1 << 31)
/** MCAN0_MCAN_TXBCR_CR30 Cancellation Request for Transmit Buffer 30 **/
#define MCAN0_MCAN_TXBCR_CR30		(1 << 30)
/** MCAN0_MCAN_TXBCR_CR29 Cancellation Request for Transmit Buffer 29 **/
#define MCAN0_MCAN_TXBCR_CR29		(1 << 29)
/** MCAN0_MCAN_TXBCR_CR28 Cancellation Request for Transmit Buffer 28 **/
#define MCAN0_MCAN_TXBCR_CR28		(1 << 28)
/** MCAN0_MCAN_TXBCR_CR27 Cancellation Request for Transmit Buffer 27 **/
#define MCAN0_MCAN_TXBCR_CR27		(1 << 27)
/** MCAN0_MCAN_TXBCR_CR26 Cancellation Request for Transmit Buffer 26 **/
#define MCAN0_MCAN_TXBCR_CR26		(1 << 26)
/** MCAN0_MCAN_TXBCR_CR25 Cancellation Request for Transmit Buffer 25 **/
#define MCAN0_MCAN_TXBCR_CR25		(1 << 25)
/** MCAN0_MCAN_TXBCR_CR24 Cancellation Request for Transmit Buffer 24 **/
#define MCAN0_MCAN_TXBCR_CR24		(1 << 24)
/** MCAN0_MCAN_TXBCR_CR23 Cancellation Request for Transmit Buffer 23 **/
#define MCAN0_MCAN_TXBCR_CR23		(1 << 23)
/** MCAN0_MCAN_TXBCR_CR22 Cancellation Request for Transmit Buffer 22 **/
#define MCAN0_MCAN_TXBCR_CR22		(1 << 22)
/** MCAN0_MCAN_TXBCR_CR21 Cancellation Request for Transmit Buffer 21 **/
#define MCAN0_MCAN_TXBCR_CR21		(1 << 21)
/** MCAN0_MCAN_TXBCR_CR20 Cancellation Request for Transmit Buffer 20 **/
#define MCAN0_MCAN_TXBCR_CR20		(1 << 20)
/** MCAN0_MCAN_TXBCR_CR19 Cancellation Request for Transmit Buffer 19 **/
#define MCAN0_MCAN_TXBCR_CR19		(1 << 19)
/** MCAN0_MCAN_TXBCR_CR18 Cancellation Request for Transmit Buffer 18 **/
#define MCAN0_MCAN_TXBCR_CR18		(1 << 18)
/** MCAN0_MCAN_TXBCR_CR17 Cancellation Request for Transmit Buffer 17 **/
#define MCAN0_MCAN_TXBCR_CR17		(1 << 17)
/** MCAN0_MCAN_TXBCR_CR16 Cancellation Request for Transmit Buffer 16 **/
#define MCAN0_MCAN_TXBCR_CR16		(1 << 16)
/** MCAN0_MCAN_TXBCR_CR15 Cancellation Request for Transmit Buffer 15 **/
#define MCAN0_MCAN_TXBCR_CR15		(1 << 15)
/** MCAN0_MCAN_TXBCR_CR14 Cancellation Request for Transmit Buffer 14 **/
#define MCAN0_MCAN_TXBCR_CR14		(1 << 14)
/** MCAN0_MCAN_TXBCR_CR13 Cancellation Request for Transmit Buffer 13 **/
#define MCAN0_MCAN_TXBCR_CR13		(1 << 13)
/** MCAN0_MCAN_TXBCR_CR12 Cancellation Request for Transmit Buffer 12 **/
#define MCAN0_MCAN_TXBCR_CR12		(1 << 12)
/** MCAN0_MCAN_TXBCR_CR11 Cancellation Request for Transmit Buffer 11 **/
#define MCAN0_MCAN_TXBCR_CR11		(1 << 11)
/** MCAN0_MCAN_TXBCR_CR10 Cancellation Request for Transmit Buffer 10 **/
#define MCAN0_MCAN_TXBCR_CR10		(1 << 10)
/** MCAN0_MCAN_TXBCR_CR9 Cancellation Request for Transmit Buffer 9 **/
#define MCAN0_MCAN_TXBCR_CR9		(1 << 9)
/** MCAN0_MCAN_TXBCR_CR8 Cancellation Request for Transmit Buffer 8 **/
#define MCAN0_MCAN_TXBCR_CR8		(1 << 8)
/** MCAN0_MCAN_TXBCR_CR7 Cancellation Request for Transmit Buffer 7 **/
#define MCAN0_MCAN_TXBCR_CR7		(1 << 7)
/** MCAN0_MCAN_TXBCR_CR6 Cancellation Request for Transmit Buffer 6 **/
#define MCAN0_MCAN_TXBCR_CR6		(1 << 6)
/** MCAN0_MCAN_TXBCR_CR5 Cancellation Request for Transmit Buffer 5 **/
#define MCAN0_MCAN_TXBCR_CR5		(1 << 5)
/** MCAN0_MCAN_TXBCR_CR4 Cancellation Request for Transmit Buffer 4 **/
#define MCAN0_MCAN_TXBCR_CR4		(1 << 4)
/** MCAN0_MCAN_TXBCR_CR3 Cancellation Request for Transmit Buffer 3 **/
#define MCAN0_MCAN_TXBCR_CR3		(1 << 3)
/** MCAN0_MCAN_TXBCR_CR2 Cancellation Request for Transmit Buffer 2 **/
#define MCAN0_MCAN_TXBCR_CR2		(1 << 2)
/** MCAN0_MCAN_TXBCR_CR1 Cancellation Request for Transmit Buffer 1 **/
#define MCAN0_MCAN_TXBCR_CR1		(1 << 1)
/** MCAN0_MCAN_TXBCR_CR0 Cancellation Request for Transmit Buffer 0 **/
#define MCAN0_MCAN_TXBCR_CR0		(1 << 0)

/**@}*/

