grevaillot/svd_tools/headers/ATSAMV71Q21B/mcan0.h
/** @defgroup mcan0_mcan_txefc MCANTXEFC Transmit Event FIFO Configuration Register
@{*/


#define MCAN0_MCAN_TXEFC_EFWM_SHIFT		24
#define MCAN0_MCAN_TXEFC_EFWM_MASK		0x3f
/** @defgroup mcan0_mcan_txefc_efwm EFWM Event FIFO Watermark
@{*/
/**@}*/


#define MCAN0_MCAN_TXEFC_EFS_SHIFT		16
#define MCAN0_MCAN_TXEFC_EFS_MASK		0x3f
/** @defgroup mcan0_mcan_txefc_efs EFS Event FIFO Size
@{*/
/**@}*/


#define MCAN0_MCAN_TXEFC_EFSA_SHIFT		2
#define MCAN0_MCAN_TXEFC_EFSA_MASK		0x3fff
/** @defgroup mcan0_mcan_txefc_efsa EFSA Event FIFO Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_txefs MCANTXEFS Transmit Event FIFO Status Register
@{*/

/** MCAN0_MCAN_TXEFS_TEFL Tx Event FIFO Element Lost **/
#define MCAN0_MCAN_TXEFS_TEFL		(1 << 25)
/** MCAN0_MCAN_TXEFS_EFF Event FIFO Full **/
#define MCAN0_MCAN_TXEFS_EFF		(1 << 24)

#define MCAN0_MCAN_TXEFS_EFPI_SHIFT		16
#define MCAN0_MCAN_TXEFS_EFPI_MASK		0x1f
/** @defgroup mcan0_mcan_txefs_efpi EFPI Event FIFO Put Index
@{*/
/**@}*/


#define MCAN0_MCAN_TXEFS_EFGI_SHIFT		8
#define MCAN0_MCAN_TXEFS_EFGI_MASK		0x1f
/** @defgroup mcan0_mcan_txefs_efgi EFGI Event FIFO Get Index
@{*/
/**@}*/


#define MCAN0_MCAN_TXEFS_EFFL_SHIFT		0
#define MCAN0_MCAN_TXEFS_EFFL_MASK		0x3f
/** @defgroup mcan0_mcan_txefs_effl EFFL Event FIFO Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_txefa MCANTXEFA Transmit Event FIFO Acknowledge Register
@{*/


#define MCAN0_MCAN_TXEFA_EFAI_SHIFT		0
#define MCAN0_MCAN_TXEFA_EFAI_MASK		0x1f
/** @defgroup mcan0_mcan_txefa_efai EFAI Event FIFO Acknowledge Index
@{*/
/**@}*/


/**@}*/
